all_words = {
    '支付清算': [
        '第三方支付',
        '在线支付',
        '移动支付',
        '电脑支付',
        '网上支付',
        '聚合支付',
        '跨境支付',
    ],
    '消费融资': [
        'P2P',
        '众筹',
        '网络小贷',
        '网上融资',
        '网上投资',
    ],
    '财富管理': [
        '互联网理财',
        '网络理财',
        '理财平台',
        '券商App',
        '互联网保险',
        '金融理财',
    ],
    '渠道业务': [
        '电子银行',
        '在线银行',
        '网银',
        '网络银行',
        '网上银行',
        '影子银行',
        '交易银行',
    ],
    '技术支持': [
        '大数据',
        '云计算',
        '人工智能',
        '区块链',
        'ABS云',
    ],
    '金融监管': [
        '监管沙盒',
        '金融稳定',
        '金融风险',
        '金融抑制',
        '金融科技',
        '监管科技',
        '合规科技',
        '监管科技',
        '风险管控',
        '数字鸿沟',
        '监管竞次',
        '监管套利',
        '风险外溢',
    ],
}
# 百度指数没有
nothing = ['跨境支付', '网络小贷', '网上投资', '券商App', '交易银行', 'ABS云', '监管沙盒',
           '金融稳定', '金融抑制', '监管科技', '合规科技', '监管科技', '风险管控', '监管竞次', '监管套利', '风险外溢']


dates = [
    2013
]

done_dates = [
    2014,
    2015,
    2016,
    2017,
    2018,
    2019,
]


def get_range_date(date):
    return f'{date}-01-01', f'{date}-12-31'


areas = {
    0: "全国",
    901: "山东",
    902: "贵州",
    903: "江西",
    904: "重庆",
    905: "内蒙古",
    906: "湖北",
    907: "辽宁",
    908: "湖南",
    909: "福建",
    910: "上海",
    911: "北京",
    912: "广西",
    913: "广东",
    914: "四川",
    915: "云南",
    916: "江苏",
    917: "浙江",
    918: "青海",
    919: "宁夏",
    920: "河北",
    921: "黑龙江",
    922: "吉林",
    923: "天津",
    924: "陕西",
    925: "甘肃",
    926: "新疆",
    927: "河南",
    928: "安徽",
    929: "山西",
    930: "海南",
    # 931: "台湾",
    932: "西藏",
    # 933: "香港",
    # 934: "澳门"
}

citys = {
    911: '北京',
    923: '天津',
    920: '河北',
    929: '山西',
    905: '内蒙古',
    907: '辽宁',
    922: '吉林',
    921: '黑龙江',
    910: '上海',
    916: '江苏',
    917: '浙江',
    928: '安徽',
    909: '福建',
    903: '江西',
    901: '山东',
    927: '河南',
    906: '湖北',
    908: '湖南',
    913: '广东',
    912: '广西',
    930: '海南',
    904: '重庆',
    914: '四川',
    902: '贵州',
    915: '云南',
    932: '西藏',
    924: '陕西',
    925: '甘肃',
    918: '青海',
    919: '宁夏',
    926: '新疆',
}

retry_data = []